{
  "homeworkSet": {
    "_id": "68d4ff1ec3508aa230f2cd91",
    "id": "68d4ff1ec3508aa230f2cd90",
    "title": "תרגיל בית 1",
    "courseId": "כולם",
    "dueAt": "2025-10-02T08:36",
    "published": true,
    "datasetPolicy": "shared",
    "questionOrder": [
      "68d519c9c3123ab5646a5b67",
      "68d519c9c3123ab5646a5b69",
      "68d519c9c3123ab5646a5b6b",
      "68d519c9c3123ab5646a5b6d",
      "68d519c9c3123ab5646a5b6f",
      "68d519c9c3123ab5646a5b71",
      "68d519c9c3123ab5646a5b73",
      "68d519c9c3123ab5646a5b75",
      "68d519c9c3123ab5646a5b77",
      "68d519c9c3123ab5646a5b79"
    ],
    "visibility": "published",
    "createdBy": "instructor-1",
    "overview": "הנחיות לתרגיל:\n\n1)\tזהו התרגיל הראשון בקורס והוא מיועד לכל קבוצות התרגול, התרגיל הינו לשבוע ימים, ויש להגיש אותו דרך אתר הקורס ב MOODLE עד יום XXX ה-XX-XX-2025 בשעה 23:59.\n2)\tזהו תרגיל מעשי ולכן על מנת לפתור תרגיל זה תצטרכו להשתמש בתוכנת MySql (הלינק להורדה והסבר על התוכנה ותפעולה מופיע באתר הקורס), אין להגיש תרגילים בכתב יד.\n3)\tתרגיל זה מבוסס על החומר שנלמד בהרצאות ובתרגולים מתחילת הסמסטר, אין שאלות על חומר מתקדם.\n4)\tההגשה תתבצע ביחידים בלבד, פורמט ההגשה של התרגיל יהיה ב PDF או WORD.\n5)\tעל כל תרגיל יש לרשום את הפרטים הבאים: שם הסטודנט , תעודת זהות , מס' קבוצת התרגול (או שעת תרגול) - תרגיל שלא יכיל את 3 הפרטים הללו – לא ייבדק !\n6)\tההגשה צריכה לכלול את הפלטים הבאים:\nI.\tבניית מסד הנתונים:\n•\tפקודות CREATE ליצירת הטבלאות (יש להראות את הפקודה לכל טבלה)\n•\tפקודות INSERT להכנסת הנתונים לטבלה (יש להראות את הפקודה לכל טבלה)\n•\tפקודת SELECT שתציג את תוכן הטבלה שנבנתה (יבוצע עבור כל טבלה)\nII.\tבניית שאילתא ב MySQL\ni.\tשלב1: הערה המציינת את מספר השאלה (אפשר להוסיף ע\"י שימוש ב */ remark /* לפני פקודת ה SELECT עצמה ששולפת את המידע.\nii.\tשלב2: פקודת SQL עובדת (ז\"א שלא מתקבלת הודעות שגיאה בביצוע execute) – יש להראות את הפקודה שבניתם.\niii.\tשלב3: תוצאת השאילתא המורצת (הטבלה המוחזרת) – יש לצרף את טבלת התוצאה המופיעה על המסך כתוצאה מהרצת השאילתא (חובה להציג כל שאילתא בפרק זה ע\"י צילום מסך (Print Screen) לכל שאילתא) - על צילומי המסך (של השאילתות) להיות גדולים וברורים כך שיהיה ניתן לקרוא אותם.\nIII.\tחשוב: אי צירוף של כל אחד מהשלבים המצוינים בסעיף 6 תגרור הורדת נקודות !\n",
    "createdAt": "2025-09-25T08:36:46.531Z",
    "updatedAt": "2025-09-25T10:30:33.682Z",
    "backgroundStory": "\nבבסיס הנתונים הבא מפורטים פרטי עובדים השייכים למחלקות שונות במפעל, כמו כן מתוארים תפקידים המשויכים לתנאי שכר שונים. המפעל המתואר הוא מפעל גלובלי המכיל מחלקות במקומות שונים על גבי הגלובוס. כעת, בתור מיישמי מערכות מידע עליכם להתמקד ב-4 הטבלאות הבאות אותם תצטרכו לבנות ועליהן להריץ את השאילתות המפורטות בהמשך לצורך בדיקת תקינות המערכת (תזכורת: אין הגבלה לכמות חיבורי הטבלאות שניתן לבצע בשאילתא)\n\nהנחייה חשובה: נא למלא את הטבלה לפי מס' ת.ז. שלך באופן הבא: ספרה הראשונה ב-ת.ז. תהיה A, ספרה שניה B וכד'.\nדוגמא: אם ת.ז. שלכם היא: 321654987 (ABCDEFGHI), אז ABC= 321, DEF= 654, GHI= 987.\n",
    "selectedDatasetId": "68d27015aa11b2703aeb753d"
  },
  "metadata": {
    "exportDate": "2025-10-23T05:15:50.510Z",
    "homeworkSetId": "68d4ff1ec3508aa230f2cd91",
    "totalQuestions": 10,
    "totalSubmissions": 2,
    "totalDatasets": 0
  }
}